; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v10)
             (pred_11 ?v3 ?v9)
             (pred_10 ?v8 ?v9)
             (pred_8 ?v4 ?v8 )
	     (pred_3 ?v8)
             (pred_5 ?v6)
             (pred_6 ?v3)
             (pred_7 ?v9)
             (pred_12 ?v8)
             (pred_9 ?v3)
             (pred_2 ?v8)
             (pred_1 ))



(:action op_1
:parameters (?v12 ?v2 ?v7 ?v5)
:precondition (and (pred_5 ?v12) (pred_5 ?v2) (pred_6 ?v7) (pred_7 ?v5)
          (pred_4 ?v12 ?v2) (pred_11 ?v7 ?v5)
                   (pred_10 ?v2 ?v5) (pred_3 ?v12) 
                   (pred_12 ?v2) (pred_9 ?v7))
:effect (and  (pred_2 ?v2) (not (pred_12 ?v2))))


(:action op_2
:parameters (?v12 ?v11)
:precondition (and (pred_5 ?v12) (pred_5 ?v11)
               (pred_3 ?v12) (pred_4 ?v12 ?v11) (pred_2 ?v11))
:effect (and (pred_3 ?v11) (not (pred_3 ?v12))))

(:action op_3
:parameters (?v12 ?v7)
:precondition (and (pred_5 ?v12) (pred_6 ?v7) 
                  (pred_3 ?v12) (pred_8 ?v7 ?v12) (pred_1 ))
:effect (and (pred_9 ?v7)
   (not (pred_8 ?v7 ?v12)) (not (pred_1 ))))


(:action op_4
:parameters (?v12 ?v1 ?v13)
:precondition (and (pred_5 ?v12) (pred_6 ?v1) (pred_6 ?v13)
                  (pred_3 ?v12) (pred_9 ?v13) (pred_8 ?v1 ?v12))
:effect (and (pred_9 ?v1) (pred_8 ?v13 ?v12)
        (not (pred_9 ?v13)) (not (pred_8 ?v1 ?v12))))

(:action op_5
:parameters (?v12 ?v7)
:precondition (and (pred_5 ?v12) (pred_6 ?v7) 
                  (pred_3 ?v12) (pred_9 ?v7))
:effect (and (pred_1 ) (pred_8 ?v7 ?v12) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_29 obj_02 obj_20 obj_19 obj_21 obj_10 obj_07 obj_12 obj_04 obj_31 obj_26 obj_28 obj_17 obj_06 obj_09 obj_11 obj_24 obj_23 obj_13 obj_18 obj_01 obj_05 obj_08 obj_03
    obj_25 obj_15 obj_14
    obj_22 obj_30 obj_27
    )

    (:init
       (pred_1)

       (pred_5 obj_16)
       (pred_5 obj_29)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_21)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_31)
       (pred_5 obj_26)
       (pred_5 obj_28)
       (pred_5 obj_17)
       (pred_5 obj_06)
       (pred_5 obj_09)
       (pred_5 obj_11)
       (pred_5 obj_24)
       (pred_5 obj_23)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_7 obj_25)
       (pred_7 obj_15)
       (pred_7 obj_14)
       (pred_6 obj_22)
       (pred_6 obj_30)
       (pred_6 obj_27)

       (pred_4 obj_16 obj_21)
       (pred_4 obj_16 obj_29)
       (pred_4 obj_29 obj_10)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_29 obj_16)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_19)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_19 obj_20)
       (pred_4 obj_21 obj_31)
       (pred_4 obj_21 obj_10)
       (pred_4 obj_21 obj_16)
       (pred_4 obj_10 obj_26)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_10 obj_29)
       (pred_4 obj_10 obj_21)
       (pred_4 obj_07 obj_28)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_07 obj_10)
       (pred_4 obj_12 obj_17)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_31 obj_09)
       (pred_4 obj_31 obj_26)
       (pred_4 obj_31 obj_21)
       (pred_4 obj_26 obj_11)
       (pred_4 obj_26 obj_28)
       (pred_4 obj_26 obj_10)
       (pred_4 obj_26 obj_31)
       (pred_4 obj_28 obj_24)
       (pred_4 obj_28 obj_17)
       (pred_4 obj_28 obj_07)
       (pred_4 obj_28 obj_26)
       (pred_4 obj_17 obj_23)
       (pred_4 obj_17 obj_06)
       (pred_4 obj_17 obj_12)
       (pred_4 obj_17 obj_28)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_17)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_31)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_24)
       (pred_4 obj_11 obj_26)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_24 obj_05)
       (pred_4 obj_24 obj_23)
       (pred_4 obj_24 obj_28)
       (pred_4 obj_24 obj_11)
       (pred_4 obj_23 obj_08)
       (pred_4 obj_23 obj_13)
       (pred_4 obj_23 obj_17)
       (pred_4 obj_23 obj_24)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_23)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_05 obj_24)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_08 obj_23)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_03 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_05)
       (pred_10  obj_07 obj_25)
       (pred_10  obj_06 obj_15)
       (pred_10  obj_05 obj_14)
       (pred_2 obj_16)
       (pred_2 obj_29)
       (pred_2 obj_02)
       (pred_2 obj_20)
       (pred_2 obj_19)
       (pred_2 obj_21)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_31)
       (pred_2 obj_26)
       (pred_2 obj_28)
       (pred_2 obj_17)
       (pred_2 obj_09)
       (pred_2 obj_11)
       (pred_2 obj_24)
       (pred_2 obj_23)
       (pred_2 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_03)

       (pred_11  obj_22 obj_25)
       (pred_11  obj_30 obj_15)
       (pred_11  obj_27 obj_14)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_27 obj_19)
       (pred_3 obj_19)
    )

    (:goal (and
       (pred_8 obj_30 obj_31)
       (pred_8 obj_27 obj_13)
    ))
(:constraints
  (always (not (pred_3 obj_24)))
)
)

; plan
1. (op_3 obj_19 obj_27)
   deleted: (pred_8 obj_27 obj_19) (pred_1)
   added: (pred_9 obj_27)
   goals met: 0 of 2
2. (op_2 obj_19 obj_20)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_20)
   goals met: 0 of 2
3. (op_2 obj_20 obj_12)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_12)
   goals met: 0 of 2
4. (op_2 obj_12 obj_17)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_17)
   goals met: 0 of 2
5. (op_2 obj_17 obj_23)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_23)
   goals met: 0 of 2
6. (op_2 obj_23 obj_13)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_13)
   goals met: 0 of 2
7. (op_5 obj_13 obj_27)
   deleted: (pred_9 obj_27)
   added: (pred_1) (pred_8 obj_27 obj_13)
   goals met: 1 of 2
8. (op_2 obj_13 obj_23)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_23)
   goals met: 1 of 2
9. (op_2 obj_23 obj_17)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_17)
   goals met: 1 of 2
10. (op_2 obj_17 obj_28)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_28)
   goals met: 1 of 2
11. (op_2 obj_28 obj_26)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_26)
   goals met: 1 of 2
12. (op_2 obj_26 obj_31)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_31)
   goals met: 1 of 2
13. (op_2 obj_31 obj_09)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_09)
   goals met: 1 of 2
14. (op_3 obj_09 obj_30)
   deleted: (pred_8 obj_30 obj_09) (pred_1)
   added: (pred_9 obj_30)
   goals met: 1 of 2
15. (op_2 obj_09 obj_31)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_31)
   goals met: 1 of 2
16. (op_5 obj_31 obj_30)
   deleted: (pred_9 obj_30)
   added: (pred_1) (pred_8 obj_30 obj_31)
   goals met: 2 of 2
